app/Http/Controllers/HoroscopeController.php

    public function index()
    {
        $user = auth()->user();

        if ($user->hasRole('user')) {
            $horoscopes = Horoscope::orderby('id', 'desc')->paginate(5);
---
select * from `horoscopes` order by `id` desc limit 5 offset 0
select count(*) as aggregate from `horoscopes`

    public function update(Request $request, $id, Horoscope $horoscope) {



        if (request('image')) {
            $request->validate([
                'image' => 'required|mimes:pdf,xlx,csv|max:2048',
            ]);
            $fileName = time().'.'.$request->image->extension();

            $request->image->move('uploads/reports', $fileName);

        }

        $dataval = request()->validate([
            'suggestions' => '',
            'status' => '',
        ]);

        $data = ([
            'suggestions' => $dataval['suggestions'],
            'status'    => $dataval['status'],
            'image' => $fileName,
        ]);

        $datanew = Horoscope::whereId($id)->first();

        $datanew->update([ //updateing to myroutes table
            'suggestions' => $dataval['suggestions'],
            'status'    => $dataval['status'],
            'image' => $fileName
        ]);
---
select * from `horoscopes` where `id` = '1' limit 1
update `horoscopes` set `suggestions` = 'test', `image` = '1592116451.pdf', `status` = 'completed', `horoscopes`.`updated_at` = '2020-06-14 06:34:11' where `id` = 1